{
  "name": "Console Controls",
  "icon": "tardis:ars_egg",
  "category": "tadditions:tardis_functions",
  "advancement": "tadditions:patchouli/fluid_link",
  "secret": true,
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Regardless of your console of choice, all TARDIS console units come equipped with the same set of controls. The only exception to this is the monitor, as some consoles will lack a monitor of their own."
    },
    {
      "type": "patchouli:text",
      "text": "The communicator allows you to send and receive signals, though your TARDIS may only receive signals if there is an active interstitial antenna installed. You may also view the names of all other active TARDISes in the world."
    },
    {
      "type": "patchouli:text",
      "text": "The coordinate increment modifier will modifier the increment of your coordinates. For example, if set to 100x, then adjusting your coordinates using the X, Y, and Z plotters will change the coordinates in increments of 100. Also applicable to the randomizer."
    },
    {
      "type": "patchouli:text",
      "text": "The dimensional shifters will select a dimension for your destination to be in. You may scroll forward or backwards depending on whether or not you are holding shift. Only applicable if the TARDIS has an active Nav-Com installed.\n"
    },
    {
      "type": "patchouli:text",
      "text": "The door control will, on use, open or close the TARDIS doors. You may shift-click the door control to lock or unlock the doors as well."
    },
    {
      "type": "patchouli:text",
      "text": "The fast return protocols will set your new coordinates to be your last landed coordinates, useful for quick return trips"
    },
    {
      "type": "patchouli:text",
      "text": "The handbrake, when activated, will stop the TARDIS from taking off in any capacity. The only exception would be summoning the TARDIS using a Stattenheim or Olim remote. The handbrake can be released at any time to resume normal function."
    },
    {
      "type": "patchouli:text",
      "text": "When a TARDIS lands, in the event that the destination coordinates are not ideal for landing, it will automatically search for the nearest suitable landing spot. The vertical land type will dictate whether the TARDIS searches above it, or below it when searching for suitable landing spots. This control is the difference between landing in a cave underground, and landing on the surface."
    },
    {
      "type": "patchouli:text",
      "text": "The refueler protocols, when enabled, cause the TARDIS to immediately being fueling. The refueling protocols will automatically disable themselves when taking flight, but may be re-activated, allowing the pilot to minimize artron consumption. Refueling capacity and speed are dependent on the TARDIS' installed artron capacitors."
    },
    {
      "type": "patchouli:text",
      "text": "The sonic port allows a player's sonic screwdriver to be inserted into the console. This can be used to upload stored schematics into a TARDIS, and charge the sonic screwdriver using the TARDIS' fuel."
    },
    {
      "type": "patchouli:text",
      "text": "The stabilizers swap the TARDIS' flight mode between stabilized and unstabilized flight, where the player can choose between speed and convenience."
    },
    {
      "type": "patchouli:text",
      "text": "The throttle is used to take off, land, and adjust the flight speed of the TARDIS. It can be increased or decreased incrementally by right clicking and shift-right clicking. Alternatively, it can be maximized or minimized by left clicking or shift-left clicking. Shift-left clicking is mandatory for landing."
    },
    {
      "type": "patchouli:text",
      "text": "Telepathic circuits can be used to locate any biome you desire, within a range of 500 blocks from the TARDIS' destination coordinates. Can be later upgraded to search for specific structures (with no range limit), with a Structure Upgrade."
    },
    {
      "type": "patchouli:text",
      "text": "The X, Y, and Z plotters allow the player to customize and set the TARDIS' destination coordinates on the X, Y, and Z axes. It is recommended to use these in tandem with the increment modifier for maximum efficiency. The plotters are unnecessary when using the telepathic circuits or selecting a waypoint."
    }
  ]
}